{
    "navbar": {
        "home": "Strona główna",
        "skills": "Umiejętności",
        "projects": "Projekty",
        "contact": "Kontakt"
    },
    "aboutMe": {
        "header": "O mnie",
        "1": "Jestem ambitną, młodą osobą chętną do nabycia nowej wiedzy i doświadczenia w branży IT. Programowaniem i tworzeniem stron oraz aplikacji internetowych zainteresowałem się na początku technikum i od tej pory uczę się nowych rzeczy, języków i technologii, robiąc przy tym projekty, które można zobaczyć w moich repozytoriach",
        "2": "Posiadam tytuł technika z informatyki i aktualnie studiuje informatykę na Politechnice Śląskiej. Szukam pracy, w której rozwinę swoje umiejętności i nabędę też nowe z pomocą bardziej doświadczonych ludzi. Dotychczas najwięcej pracowałem we frontendzie, zrobiłem kilka do dziś aktywnych stron, ale chciałbym się również rozwinąć w obszarze backendu.",
        "3": "Strona ta ma być moim internetowym CV i opisać oraz pokazać moje zarówno umiejętności jak i doświadczenie. Niżej zamieszczę również formularz pozwalający sie skontaktować ze mną drogą mailową, oraz CV w postaci standardowego pliku PDF.",
        "showText": "Czytaj więcej",
        "hideText": "Zwiń tekst"
    },
    "education": {
        "header": "Edukacja",
        "places": [
            {
                "title": "Politechnika Śląska w Gliwicach (2023 – obecnie)",
                "description": "Kierunek: Informatyka"
            },
            {
                "title": "Techniczne Zakłady Naukowe w Częstochowie (2019-2023)",
                "description": "Kierunek: Technik Informatyk"
            },
            {
                "title": "EduPlus – dwutygodniowe praktyki z Erasmus+",
                "description": "Praktyki podczas których programowałem aplikacje w technologii Windows Forms w anglojęzycznym zespole"
            },
            {
                "title": "Jupiter – szkoła frontendu i tworzenia gier (2021-2023)",
                "description": "Zajęcia z tworzenia stron internetowych"
            }
        ]
    },
    "skills": {
        "header": "Umiejętności",
        "Frontend": {
            "CSS": "Potrafię stylować strony zarówno natywnym CSS jak i preprocesorem SCSS. Umiem tworzyć strony responsywne i znam bibliotekę Bootstrapa.",
            "HTML": "Znam i umiem korzystać z wielu elementów strony dostępnych w HTML takich jak listy, tabele i wiele innych. Znam również znaczniki meta i umiem tworzyć poprawny układu strony np. stosować się do metodologii BEM.",
            "JS": "Znam składnie języka i wbudowane w nim funkcje (pętle, tablice, instrukcje warunkowe, podstawy obiektowości). Potrafię operować na DOM poprzez standardowy JavaScript lub jQuery, renderować DOM na bazie JSON czytanego z publicznego API."
        },
        "Backend": {
            "CPP": "Znam składnie i funkcje języka. Potrafię operować na plikach i znam podstawy programowania obiektowego.",
            "Python": "Znam podstawowe funkcje języka takich jak funkcje warunkowe, pętle, umiem operować na listach, plikach tekstowych i pisać własne funkcje.",
            "SQL": "Potrafie koszystać z podstawowych poleceń takich jak select, update, where. Umiem filtrować i sortować dane. Jestem w stanie połączyć stronę z bazą danych i operować na nich przy pomocy PHP."
        },
        "React": "Potrafię pracować z biblioteką React, tworzyć komponentów funkcyjne, pisać modułowy kod i znam składnie JSX. Dobrym przykładem mojej pracy w tej bibliotece jest ta strona, która została stworzona w tej właśnie bibliotece. Do jej stylowania użyłem biblioteki React-Bootstrap, która pozwala użyć gotowych komnonetów Reacta posiadających już style standardowego Bootstrapa. Do stworzenia strony użyłem również narzędzia Vite."
    },
    "OtherInfo": {
        "otherSkillsHeader": "Inne umiejętności",
        "OtherSkills": [
            "Github - podstawowa znajomość serwisu i związanych z nim poleceń w konsoli",
            "Angielski - znajomość języka na poziomie B2",
            "Photoshop - podstawowa znajomość programu i umiejętność modyfikowania grafiki"
        ],
        "coursesHeader": "Kursy i certyfikaty",
        "Courses": [
            "PCAP: Programming Essentials in Python",
            "Udemy: React – Complete Guide 2025 (Academind) (w trakcie)",
            "Udemy: Zaawansowane projekty w CSS i JavaScript (Samuraj Programowania)"
        ]
    },
    "projects": {
        "header": "Moje projekty",
        "linkInfo": "Link do repozytorium GitHub",
        "SWAPI": {
            "title": "Star Wars API",
            "description": "Strona która pobiera dane z zewnętrznego API i wstawia je do tabeli, strona została stworzona z JavaScript  i Bootstrap.",
            "description2": "Strona która pobiera dane z zewnętrznego API i wstawia je do dynamicznie tworzonej tabeli. Działanie strony zostało stworzone w JavaScript, a do stylowania strony użyłem biblioteki Bootstrap. Stronę stworzyłem by pokazać moje umięjętności działania z publicznym API. Strona posiada menu gdzie można wybrać czy chcemy przeglądać baze postaci czy planet z uniwersum Star Wars.",
            "link": "https://github.com/IgorMatlingiewicz/StarWarsApi"
        },
        "ticTacToe": {
            "title": "React Tic-Tac-Toe",
            "description": "Gra w kółko i krzyżyk dla dwóch osób stworzona w React.",
            "description2": "Standardowa gra w kółko i krzyżyk dla dwóch osób stworzona w React. Do jej stworzenia użyłem funkcji jakie daje nam React takich jak stan. Pod planszą gry umieściłem dynamicznie generowaną historię ruchów danych zawodników.",
            "link": "https://github.com/IgorMatlingiewicz/ReactTicTacToe"
        },
        "nightSky": {
            "title": "Night Sky",
            "description": "Mały projekt z elementem canvas pokazujący nocne niebo z losowo generowanymi konstelacjami.",
            "description2": "Mały projekt przy użyciu elementu canvas który pokazuje gwieździste niebo i losowo generowane konstelacje łączace te gwiazdy. Porjekt głównie stworzony przy użyciu JavaScript.",
            "link": "https://github.com/IgorMatlingiewicz/NightSky"
        }
    },
    "contact": {
        "header": "Kontakt",
        "contactOptions": "Można skontaktować sie ze mną drogą telefoniczną lub mailową:",
        "form": {
            "formInfo": "Można też wysłać do mnie wiadomość mailową w poniższym formularzu:",
            "name": "Imie i nazwisko",
            "phone": "Numer telefonu (opcjonalne)",
            "message": "Treść wiadomości:",
            "agreement": "* Wyrażam zgodę na przetwarzanie przez właściciela strony moich danych osobowych zawartych w formularzu w celu udzielenia odpowiedzi na zadane poprzez formularz pytania.",
            "submit": "Wyślij"
        },
        "modal": {
            "success": {
                "title": "Sukces!",
                "message": "Twója wiadomość została poprawnie wysłana."
            },
            "error": {
                "title": "Błąd!",
                "message": "Wystąpił błąd przy wysyłaniu wiadomości: "
            },
            "button": "Zamknij"
        }
    },
    "links": {
        "header": "Linki",
        "github": "Moje konto GitHub",
        "CV": "Moje CV w formie PDF"
    }
}